app/controllers/application_controller.rb

  def current_author
    return nil if !session[:auth] || !session[:auth]['id']
    return @_author if @_author
    @_author = Author.find_by_id(session[:auth]['id'])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]