app/controllers/authors_controller.rb

  def create
     author_params = params.require(:author).permit(:username, :email, :password, :password_confirmation)
     @author = Author.new(author_params)
     if @author.valid?
        @author.save
---
INSERT INTO "authors" ("username", "email", "confirmation_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"