app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def show
    @cities = City.find(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cities = City.find(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "nom_ville" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["nom_ville", "setif"], ["updated_at", "2019-10-30 16:03:40.188772"], ["id", 1]]
---
  def update
    @cities = City.find(params[:id])
    @cities.update(cities_params)

INSERT INTO "cities" ("nom_ville", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nom_ville", "wwww"], ["created_at", "2019-10-30 16:09:03.384179"], ["updated_at", "2019-10-30 16:09:03.384179"]]
---
  def create
    city = City.create(cities_params)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 26]]
---
  def destroy
    @cities = City.find(params[:id])
    @cities.destroy