app/controllers/gossips_controller.rb

  def show
    @gossips = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def edit
    @gossips = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @gossips = Gossip.find(params[:id])
    @gossips.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "gossips" SET "contenu" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["contenu", "[\"Sunt id delectus. Occaecati alias saepe. Eum pariatur architecto.]"], ["updated_at", "2019-10-30 13:09:38.516818"], ["id", 3]]

  def create
    gossip = Gossip.create(gossip_params)
---
INSERT INTO "gossips" ("titre", "contenu", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titre", "walidmersaoui"], ["contenu", "walidersapoiiii the haki"], ["created_at", "2019-10-30 13:32:20.405686"], ["updated_at", "2019-10-30 13:32:20.405686"]]

  def destroy
    @gossips = Gossip.find(params[:id])
    @gossips.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 21]]