app/controllers/sessions_controller.rb

SELECT  "authors".* FROM "authors" WHERE ("authors"."username" = $1 OR "authors"."email" IS NULL) ORDER BY "authors"."id" ASC LIMIT $2  [["username", "www"], ["LIMIT", 1]]
---
  def create
    author_params = params.require(:author)
    @author = Author.where(username: author_params[:username]).or(Author.where(email: author_params[:email])).first